ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/ВКМ_ГрафикОтпусков.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВКМ_ГрафикОтпусков</name>
  <registerRecords>AccumulationRegister.ВКМ_ЗапланированныеОтпуска</registerRecords>
  <attributes>
    <name>ВКМ_Год</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>4</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВКМ_ОтпускаСотрудников</name>
    <attributes>
      <name>ВКМ_Сотрудник</name>
      <type>
        <types>CatalogRef.ВКМ_Сотрудники</types>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаНачала</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ВКМ_ДатаОкончания</name>
      <type>
        <types>Date</types>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

ConfigurationFonecmidDiplomTuzeka/src/Documents/ВКМ_ГрафикОтпусков/Forms/ВКМ_ФормаДокумента/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)

	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	ОбновитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)

	ПодключаемыеКомандыКлиент.НачатьОбновлениеКоманд(ЭтотОбъект);

КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)

	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	ОбновитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)

	ПодключаемыеКомандыКлиент.ПослеЗаписи(ЭтотОбъект, Объект, ПараметрыЗаписи);

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыВКМ_ОтпускаСотрудников

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_СотрудникПриИзменении(Элемент)

	ОбновитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаНачалаПриИзменении(Элемент)

	ОбновитьУсловноеОформление();

КонецПроцедуры

&НаКлиенте
Процедура ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончанияПриИзменении(Элемент)

	ОбновитьУсловноеОформление();

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ВКМ_АнализГрафика(Команда)

	АдресХранилища = ВКМ_ПоместитьДанныеВоВременноеХранилище();

	ПараметрыОткрытия = Новый Структура;
	ПараметрыОткрытия.Вставить("АдресХранилища", АдресХранилища);
	ПараметрыОткрытия.Вставить("Год", Объект.ВКМ_Год);

	ОткрытьФорму("Документ.ВКМ_ГрафикОтпусков.Форма.ВКМ_ФормаАнализГрафика", ПараметрыОткрытия, ЭтотОбъект);

КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция ВКМ_ПоместитьДанныеВоВременноеХранилище()

	Возврат ПоместитьВоВременноеХранилище(Объект.ВКМ_ОтпускаСотрудников.Выгрузить(), УникальныйИдентификатор);

КонецФункции

&НаСервере
Процедура ОбновитьУсловноеОформление()

	УсловноеОформление.Элементы.Очистить();

	КалендарныхДнейПоСотрудникам = Новый Соответствие;

	Для Каждого СтрокаОтпуска Из Объект.ВКМ_ОтпускаСотрудников Цикл

		Если Не ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_Сотрудник)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_ДатаНачала)
			Или Не ЗначениеЗаполнено(СтрокаОтпуска.ВКМ_ДатаОкончания) Тогда
			Продолжить;
		КонецЕсли;

		КоличествоДней = ВКМ_ПроизводственныйКалендарь.ВКМ_КоличествоКалендарныхДней(
			СтрокаОтпуска.ВКМ_ДатаНачала, СтрокаОтпуска.ВКМ_ДатаОкончания);

		Если КалендарныхДнейПоСотрудникам[СтрокаОтпуска.ВКМ_Сотрудник] = Неопределено Тогда
			КалендарныхДнейПоСотрудникам.Вставить(СтрокаОтпуска.ВКМ_Сотрудник, КоличествоДней);
		Иначе
			КалендарныхДнейПоСотрудникам[СтрокаОтпуска.ВКМ_Сотрудник] =
				КалендарныхДнейПоСотрудникам[СтрокаОтпуска.ВКМ_Сотрудник] + КоличествоДней;
		КонецЕсли;

	КонецЦикла;

	МинимальныйОтпускДней = 28;

	Для Каждого ЭлементСотрудника Из КалендарныхДнейПоСотрудникам Цикл

		Если ЭлементСотрудника.Значение <= МинимальныйОтпускДней Тогда
			Продолжить;
		КонецЕсли;

		Элемент = УсловноеОформление.Элементы.Добавить();

		ПолеСотрудник = Элемент.Поля.Элементы.Добавить();
		ПолеСотрудник.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудниковВКМ_Сотрудник");

		ПолеДатаНачала = Элемент.Поля.Элементы.Добавить();
		ПолеДатаНачала.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудниковВКМ_ДатаНачала");

		ПолеДатаОкончания = Элемент.Поля.Элементы.Добавить();
		ПолеДатаОкончания.Поле = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудниковВКМ_ДатаОкончания");

		ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
		ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ВКМ_ОтпускаСотрудниковВКМ_Сотрудник");
		ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
		ОтборЭлемента.ПравоеЗначение = ЭлементСотрудника.Ключ;

		Элемент.Оформление.УстановитьЗначениеПараметра("ЦветФона", WebЦвета.Хаки);

	КонецЦикла;

КонецПроцедуры

#Область ПодключаемыеКоманды

&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ПодключаемыеКомандыКлиент.НачатьВыполнениеКоманды(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ПродолжитьВыполнениеКомандыНаСервере(ПараметрыВыполнения, ДополнительныеПараметры) Экспорт
	ВыполнитьКомандуНаСервере(ПараметрыВыполнения);
КонецПроцедуры

&НаСервере
Процедура ВыполнитьКомандуНаСервере(Знач ПараметрыВыполнения)
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, ПараметрыВыполнения, Объект);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры

#КонецОбласти

#КонецОбласти
